{"intents": [
  {"tag": "greeting",
   "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
   "responses": ["Hello", "Good to see you again", "Hi there, how can I help?"],
   "context": [""]
  },
  {"tag": "goodbye",
   "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
   "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
   "context": [""]
  },
  {"tag": "thanks",
   "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
   "responses": ["My pleasure", "You're Welcome"],
   "context": [""]
  },
  {
    "tag": "dignitaries",
    "patterns": [
        "Who are the dignitaries of Medi-Caps University?", 
        "Tell me about Medi-Caps University officials"
    ],
    "responses": [
        "The dignitaries of Medi-Caps University include the Chancellor, R.C. Mittal; the Vice Chancellor, Prof. Dilip Kumar Patnaik; the Pro-Chancellor, Gopal Agarwal; the Pro Vice Chancellor, Dr. D.K. Panda; and the Registrar, P. Siluvanathan. Other key dignitaries include Palash Garg (OSD to Chancellor), Mrs. Saloni Garg (Director Branding), and Dr. Ankur Saxena (Deputy PVC)."
    ],
    "context": [""]
},
{
  "tag": "clubs_and_organizations",
  "patterns": [
      "What clubs are available at Medi-Caps University?", 
      "Tell me about the clubs at Medi-Caps", 
      "What extracurricular activities can I join?", 
      "What student organizations are there?"
  ],
  "responses": [
      "Medi-Caps University offers a variety of student clubs, including the Sports Club, which promotes physical fitness and organizes sports events at regional and national levels; the Cultural Club, which focuses on cultural activities such as dance, music, and drama, with major events like the annual cultural fest; the Technical Club, which encourages engagement in tech-related activities, coding competitions, and workshops; and the Entrepreneurship Club, which fosters entrepreneurial skills and provides a platform for students to explore startups and business initiatives."
  ],
  "context": [""]
},
  {
      "tag": "admission_criteria",
      "patterns": [
          "What is the admission process for Medi-Caps University?", 
          "How can I apply for admission?", 
          "Tell me about the admission criteria at Medi-Caps University"
      ],
      "responses": [
          "The admission process at Medi-Caps University follows a structured procedure to ensure fairness and transparency. For undergraduate programs like B.Tech, BBA, and BCA, candidates must have passed 10+2 with relevant subjects from a recognized board. Admission is based on the JEE Main score for B.Tech programs or university-level exams for other courses. Merit-based admission is available for certain courses, considering academic performance and entrance exam scores. For postgraduate programs like M.Tech and MBA, candidates need a relevant undergraduate degree. Admission for M.Tech is based on the GATE score or university-level exams, while MBA candidates require a valid score in CAT, MAT, XAT, or similar exams. For Ph.D. programs, candidates need a Master’s degree in a relevant field and must appear for an entrance exam and interview as per the university's guidelines."
      ],
      "context": [""]
  },
  {
      "tag": "department_info",
      "patterns": [
          "What departments are there in Medi-Caps University?",
          "Tell me about the academic departments at Medi-Caps",
          "What are the major departments at Medi-Caps University?"
      ],
      "responses": [
          "Medi-Caps University has several departments, including Computer Science, Mechanical Engineering, Civil Engineering, Electrical Engineering, and Electronics & Communication. Each department offers undergraduate and postgraduate courses. Other departments include Management, Applied Sciences, Humanities, Law, and Pharmacy. You can find more specific information about each department on the university's website."
      ],
      "context": [""]
  },
  {
      "tag": "course_information",
      "patterns": [
          "What courses are available?", 
          "Can you tell me about my courses?", 
          "Help with course selection", 
          "What are my major requirements?"
      ],
      "responses": [
          "Course catalogs are typically available on your university’s website. For personalized advice, consider reaching out to your academic advisor. Your department might also have specific requirements or elective options—check your student portal for more info."
      ],
      "context": [""]
  },
  {
      "tag": "scholarships",
      "patterns": [
          "How can I apply for scholarships at Medi-Caps University?", 
          "Are there any scholarships for students at Medi-Caps?", 
          "Tell me about scholarship opportunities at Medi-Caps."
      ],
      "responses": [
          "Medi-Caps University offers scholarships based on merit and financial need. You can apply for them through the university's portal or contact the financial aid office for more details. Scholarships are awarded to students with exceptional academic performance. You can find more information on the university website or by contacting the admissions office."
      ],
      "context": [""]
  },
  {
      "tag": "placement_opportunities",
      "patterns": [
          "What are the placement opportunities at Medi-Caps?", 
          "Tell me about the placement records of Medi-Caps University", 
          "Does Medi-Caps University have a placement cell?"
      ],
      "responses": [
          "Medi-Caps University has a strong track record of placements, with a dedicated Placement Cell to facilitate internship and job opportunities for students. The placement process includes on-campus recruitment drives with major companies from various sectors, pre-placement training such as workshops, resume building, and interview preparation, and strong industry connections with top companies like TCS, Wipro, Infosys, HCL, Cognizant, and others. The university ensures students have access to a wide range of opportunities and resources to succeed in their careers."
      ],
      "context": [""]
  }


]}